#!/bin/bash

# ------------------------------------------------------------------------------------------------------------------------------
# Скрипт для обробки записів дзвінків
# 
# фУНКЦІЇ
# -------
# 1. Конвертування записів дзвінків із WAV у MP3
# 2. Розподіл записів дзвінків по папках відповідно до дати
# 3. Видалення старих записів дзвінків
#
# Є кілька режимів роботи скрипту:
#
# 1. Тільки конвертування записів дзвінків з WAV в MP3, з видаленням WAV файлів,
# БЕЗ переміщення по папках відповідно до дати
#
# 2. Тільки переміщення записів дзвінків по папках відповідно до дати, БЕЗ
# конвертування файлів із WAV у MP3
#
# 3. Конвертування записів дзвінків з WAV в MP3, з видаленням WAV файлів,
# І переміщення файлів по папках відповідно до дати
# УВАГА! Якщо увімкнено одночасно конвертацію в MP3 і переміщення файлів записів дзвінків по папках відповідно до дати
# То необхідно встановити значення DEPTH=1, інакше файли не будуть переміщені
#
# 4. Видалення старих записів дзвінків. Можна використовувати в поєднанні з трьома першими режимами
#
# ------------------------------------------------------------------------------------------------------------------------------

## Змінні для формування шляхів до папок із датами. НЕ змінювати!
# Рік (2017)
Y=`date +%Y`
# Місяць (04)
M=`date +%m -d "-1 day"`
# Вчорашнє число (27)
D=`date +%d -d "-1 day"`
# Вчорашня дата (2017-04)
YM=`date +%Y-%m -d "-1 day"`
# Вчорашня дата (2017-04-27)
YMD=`date +%Y-%m-%d -d "-1 day"`


## Папка, де знаходяться записи дзвінків. Наприклад: "/var/calls/". СЛЕШ в кінці!
DIR_SOURCE="/var/calls/"

## Кінцева папка для файлів записів дзвінків, куди вони будуть переміщені. СЛЕШ в кінці!
# Наприклад: "/var/calls/$Y/$M/$D/"
# Наприклад: "/var/calls/$Y/$YM/$YMD/"
DIR_DST="/var/calls/$Y/$YM/$YMD/"

## Переміщати файли записів дзвінків по папках відповідно до дати. -> true, false
# Кінцева папка береться зі змінної DIR_DST
MOVE_BY_DATE=true

## Конвертувати файли записів дзвінків у формат MP3. -> true, false
CONV_TO_MP3=true

## Змінити власника і групу для файлу після його конвертації на це значення
# Наприклад: "user:group". Найкраще встановити ім'я та групу від яких запускається Asterisk
USER_GROUP="asterisk:asterisk"

## Рівень вкладеності папок для пошуку файлів записів дзвінків під час конвертації -> ціле число
# Наприклад: Якщо 1 - пошук файлів тільки в папці /var/calls/, 2 - пошук файлів в /var/calls/ і в /var/calls/[Будь-яка_папка]/
# Можна вказати, наприклад: 9999. Це корисно, якщо налаштовано тільки конвертування записів дзвінків, БЕЗ переміщення файлів.
# Тоді всі файли в /var/calls/ і в усіх вкладених папках будуть перетворені в MP3
DEPTH=1

## Бітрейт MP3 файлів, під час конвертації з WAV у MP3. Вказується в Кбіт/с -> ціле число
BITRATE=32

## Не конвертувати файли, розмір яких менше заданого. Розмір задається в кілобайтах
# Файли, розмір яких менший "REMOVE_MIN_SIZE" будуть видалені перед конвертуванням
# Якщо задано "0", то вимкнено
# Працює, якщо задано CONV_TO_MP3=true
REMOVE_MIN_SIZE=0

## Видаляти старі записи дзвінків. -> true, false
# Файли видаляються з папки, заданої в DIR_SOURCE, а також з усіх вкладених папок
CLEAN_OLD=false

## Кількість днів зберігання записів дзвінків, після яких файли записів будуть видалені з диска
# Працює, якщо задано CLEAN_OLD=true
CLEAN_OLD_AFTER=365

## Видаляти файли, розмір яких менший за заданий. Розмір задається в кілобайтах
# Якщо задано "0", то вимкнено
# Працює, якщо задано CLEAN_OLD=true
CLEAN_OLD_MIN_SIZE=0

## Видаляти "порожні папки" з папки, заданої в DIR_SOURCE, а також з усіх вкладених папок
# Працює, якщо задано CLEAN_OLD=true
CLEAN_OLD_EMPTYDIR=true


if [ "$MOVE_BY_DATE" == true ]; then
	mkdir -p "$DIR_DST"
fi	

if [ "$CONV_TO_MP3" == true ]; then
	if [ "$REMOVE_MIN_SIZE" != "0" ]; then
		find "$DIR_SOURCE" -maxdepth $DEPTH -type f -name "*$YMD*.wav" -size -"$REMOVE_MIN_SIZE"k -exec rm -rf {} \;
	fi
	find "$DIR_SOURCE" -maxdepth $DEPTH -type f -name "*$YMD*.wav" -print0 | while IFS= read -r -d $'\0' line; do
		TMP_SOURCE="$line"
		TMP_CONV="${line%.wav}.mp3"
		nice -n 19 /usr/bin/lame -b $BITRATE --silent "$TMP_SOURCE" "$TMP_CONV";
		chown "$USER_GROUP" "$TMP_CONV"
		rm -f "$TMP_SOURCE"
		if [[ "$MOVE_BY_DATE" == true && "$DEPTH" == "1" ]]; then
			mv "$TMP_CONV" "$DIR_DST"
		fi
	done
fi	

if [[ "$MOVE_BY_DATE" == true && "$CONV_TO_MP3" == false ]]; then
	mv "$DIR_SOURCE"*$YMD* "$DIR_DST"
fi

if [ "$CLEAN_OLD" == true ]; then
	if [ "$CLEAN_OLD_MIN_SIZE" != "0" ]; then
		find "$DIR_SOURCE" -type f -size -"$CLEAN_OLD_MIN_SIZE"k -exec rm -rf {} \;
	fi
	find "${DIR_SOURCE}" -type f -mtime +"$CLEAN_OLD_AFTER" -exec rm -rf {} \;
	if [ "$CLEAN_OLD_EMPTYDIR" == true ]; then
		find "${DIR_SOURCE}" -type d -empty -exec rm -rf {} \;
	fi
fi

